app/controllers/posts_controller.rb

INSERT INTO `posts` (`image_url`, `updated_at`, `title`, `description`, `created_at`) VALUES('http://algerian.markm.cd/images/sexysummersandals.jpg', '2009-12-16 14:25:12', 'Sexy Summer Sandals', '(via @dos4gw)', '2009-12-16 14:25:12')
---
  def create
    @post = Post.new(params[:post])

    @post.update_attribute(:user_id, current_user.id)

    respond_to do |format|
      if @post.save

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
UPDATE `posts` SET `updated_at` = '2009-12-17 04:01:03', `image_url` = '/images/sexysummersandals.jpg' WHERE `id` = 1
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])